In [16]:
import pandas as pd

title_aka_df = pd.read_csv('zippedData/imdb.title.akas.csv.gz')
title_basics_df = pd.read_csv('zippedData/imdb.title.basics.csv.gz')
title_crews_df = pd.read_csv('zippedData/imdb.title.crew.csv.gz')
title_principals_df = pd.read_csv('zippedData/imdb.title.principals.csv.gz')
title_ratings_df = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')

title_ratings_df.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [3]:
title_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [7]:
title_df['region'].unique()

214

In [9]:
title_original = title_df[title_df['is_original_title'] == 1.0]
title_original.shape

(44700, 8)

In [10]:
title_original['region'].unique()

array([nan, 'US', 'XWW', 'CN'], dtype=object)

In [15]:
cn_df = title_original[title_original['region'] == 'CN']
cn_df.head(20)

,title_id,ordering,title,region,language,types,attributes,is_original_title
198968,tt4537986,1,Zhui bu,CN,cmn,original,NaN,1.0

Notes:
-Not much here yet